import pandas as pd

data = {
    'Name' : ['Алиса', 'Антон', 'Михаил', 'Тимур', 'Елена', 'Анна', 'Максим', 'Олег', 'Дмитрий', 'Сергей'],
    'Math' : [5, 4, 4, 3, 5, 4, 4, 3, 3, 3],
    'Geography' : [5, 5, 4, 4, 3, 5, 4, 4, 3, 3],
    'Biology' : [5, 5, 5, 4, 5, 3, 4, 3, 4, 3],
    'Chemistry' : [4, 4, 5, 5, 3, 3, 4, 5, 3, 5],
    'Physics' : [4, 5, 3, 3, 5, 3, 3, 4, 5, 5]
}


df = pd.DataFrame(data)

#Вывод первых 5 строк
print(df.head())

#Вывод средней оценки по каждому предмету
print(f"Средняя оценка по математике - {df['Math'].mean()}")
print(f"Средняя оценка по географии - {df['Geography'].mean()}")
print(f"Средняя оценка по биологии - {df['Biology'].mean()}")
print(f"Средняя оценка по химии - {df['Chemistry'].mean()}")
print(f"Средняя оценка по физике - {df['Physics'].mean()}")

#Вывод средней оценки по каждому предмету
print(f"Медианная оценка по математике - {df['Math'].median()}")
print(f"Медианная оценка по географии - {df['Geography'].median()}")
print(f"Медианная оценка по биологии - {df['Biology'].median()}")
print(f"Медианная оценка по химии - {df['Chemistry'].median()}")
print(f"Медианная оценка по физике - {df['Physics'].median()}")

#Вычислим Q1, Q3 и IQR для оценок по математике
Q1_math = df['Math'].quantile(0.25)
Q3_math = df['Math'].quantile(0.75)
IQR_math = Q3_math - Q1_math

#Вычислим стандартное отклонение по каждому предмету
print(f"Стандартное отклонение оценок по математике - {df['Math'].std()}")
print(f"Стандартное отклонение оценок по географии - {df['Geography'].std()}")
print(f"Стандартное отклонение оценок по биологии - {df['Biology'].std()}")
print(f"Стандартное отклонение оценок по химии - {df['Chemistry'].std()}")
print(f"Стандартное отклонение оценок по физике - {df['Physics'].std()}")